/*********************************************************************
    程序名:
    版权:
    作者:
    日期: 2023-10-22 15:15
    说明:
*********************************************************************/
#include <bits/stdc++.h>
using namespace std;

int x, y;
int n, m;

int a[16][16];

int dp[16][16] = {1};

int main() {
	cin >> n >> m;
	cin >> x >> y;
	a[x][y] = a[x - 2][y - 1] = a[x - 2][y + 1] = a[x + 2][y - 1] = a[x + 2][y + 1] = a[x - 1][y + 2] = a[x + 1][y + 2] =
	                                a[x - 1][y - 2] = a[x + 1][y - 2] = 1;
	for (int i = 0; i <= n; i++) {
		for (int j = 0; j <= m; j++) {
			if (i == 0 && j == 0)
				continue;
			if (a[i][j] != 1) {
				dp[i][j] = dp[i][j - 1] + dp[i - 1][j];
			}
		}
	}
	cout << dp[n][m];
	return 0;
}
